// data  tayp , тип данных-маалымат турлору
// data  tayp 2ге болунот :
// 1)ссылычный
// 2) привитивный

// number - 12345678;
// string - "stroka" , "" , "     ";
// boolen - true - false;
// undefaind - белгисиз нерсе;
// nul - жок нерсе ;
// symbol - =, +, -;
// bigint - чон сан ;
// object - {}

//  переменные :
// var - ES5
// const - ES6 значениясын озгортсо болбойт
// let - ES6 озгортсо болот

// +
// -
// *
// **
// /
// %

// let num = 10;
// num = 20;
// console.log(num);

// const num = 10;
// num = 20;
// console.log(num);

// let sun = 10;
// let num = 15;
// console.log(sun + 5 + num);

// console.log(5 + 4);
// console.log(50 - 40);
// console.log(4 * 3);
// console.log(5 ** 3);
// console.log(10 / 2);
// console.log(7 % 3);

//  Math()
// console.log(Math.abs(-70)); - дайыма он сан чыгарып берет
// console.log(Math.floor(5.4)); - ылдыйга иштейт
// console.log(Math.ceil(9.2)); - ойдого иштейт
// console.log(Math.round(5.5)); - тегеректейт
// console.log(Math.random() *100); - рандомный сан
// console.log(Math.trunc(3.88754)); - Сан озу иштейт,точкадан кийинки санды окубайт
// console.log(Math.sqrt(2)); -(корен дерди чыгарат тамыр алдында)
// console.log(Math.pow(7, 6));  **

// console.log(Math.round(Math.random() * 100));

// 1. Вам дана переменная num, присвойте ей значение. Выведите значение этой переменной в консоль.
// let num = 10
// console.log(num);

// 2. Вам даны переменные a=10, b=2 и c=5. Выведите в консоль их сумму.
// let a = 10;
// b = 2;
// c = 5;
// console.log(a + b + c);

// 3. Вам дана переменная со значением 100, выведите в консоль умноженную переменную на 2.
// let num = 100;
// console.log(num * 2);

// 4. Вам дана переменная со значением 67. Выведите в консоль остаток деления на 7.
// let sun = 67;
// console.log(sun % 7);

// 5. Вам даны переменные a=10 и b=2. Выведите в консоль их сумму, разность, произведение и частное (результат деления).
// let a = 10;
// b = 2;
// console.log(a + b);
// console.log(a - b);

// 6. Вам даны переменные c=15 и d=2. Просуммируйте их, а результат присвойте переменной result. Выведите в консоль значение переменной result.
// let c = 15,
//     d = 2;
// let result = c + d;
// console.log(result);

// 7. Вам даны переменные a=30, и b=15 Сложите переменные a и b и результат присвойте переменной c. Затем выведите в консоль остаток деления на 4 переменной c.
// let a = 30,
//     b = 15;
// let c = a + b;
// console.log(c % 4);

// 8. Вам даны переменные a=17 и b=10. Отнимите от a переменную b и результат присвойте переменной c. Затем создайте переменную d, присвойте ей значение. Сложите переменные c и d, а результат запишите в переменную result. Выведите в консоль значение переменной result.
// let a = 17,
//     b = 10;
// let c = a - b;
// let d = 120;
// let result = c + d;
// console.log(result);
